TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/dsp/dsp_fpu_fft_fpu32_f28003x.c
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

//
// Used for memory alignment
//
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif

float test_input[256] = {
                         77.000000000000F,    0.000000000000F,   45.321542597114F,   28.517201792762F,
                         48.938746669790F,   48.715947146598F,   -1.272077938642F,   55.440734982460F,
                         -0.983392686809F,   48.522509446919F,  -39.677179906405F,   32.517610835512F,
                        -19.000000000000F,   14.535898384862F,  -37.248078874273F,    1.159151854595F,
                         -3.866896714861F,   -4.183818756445F,  -20.727922061358F,   -2.272077938642F,
                          4.544646017019F,    2.791513911032F,  -23.995238822098F,    5.886255830454F,
                         -7.000000000000F,    3.464101615138F,  -35.741825477920F,   -4.789688774154F,
                        -10.571849954929F,  -15.953290065266F,  -26.727922061358F,  -25.440734982460F,
                          9.350289401670F,  -29.323642301185F,   -2.704627201468F,  -26.245123854120F,
                         29.000000000000F,  -18.000000000000F,    6.612858422223F,   -8.528205892286F,
                         27.350289401670F,   -1.853272235055F,   -1.272077938642F,   -0.015109140256F,
                         20.605064581311F,   -2.046709934734F,   -0.968495731513F,   -4.527796849537F,
                         29.000000000000F,   -3.464101615138F,   10.778090924309F,    3.431229793237F,
                         35.721560553259F,   15.208486088968F,    4.727922061358F,   27.727922061358F,
                         14.133103285139F,   35.360733292685F,  -27.930593250582F,   33.614177891811F,
                        -19.000000000000F,   21.464101615138F,  -48.994665530095F,    2.255718910894F,
                        -18.983392686809F,  -17.345594910680F,  -26.727922061358F,  -29.984890859744F,
                         17.761832133551F,  -30.715947146598F,   10.548212850708F,  -19.199716169072F,
                         41.000000000000F,    0.000000000000F,   10.548212850708F,   19.199716169072F,
                         17.761832133550F,   30.715947146598F,  -26.727922061358F,   29.984890859744F,
                        -18.983392686809F,   17.345594910680F,  -48.994665530095F,   -2.255718910895F,
                        -19.000000000000F,  -21.464101615138F,  -27.930593250582F,  -33.614177891812F,
                         14.133103285139F,  -35.360733292685F,    4.727922061358F,  -27.727922061358F,
                         35.721560553259F,  -15.208486088968F,   10.778090924309F,   -3.431229793237F,
                         29.000000000000F,    3.464101615138F,   -0.968495731514F,    4.527796849536F,
                         20.605064581310F,    2.046709934734F,   -1.272077938642F,    0.015109140255F,
                         27.350289401670F,    1.853272235055F,    6.612858422223F,    8.528205892286F,
                         29.000000000000F,   18.000000000000F,   -2.704627201468F,   26.245123854120F,
                          9.350289401671F,   29.323642301185F,  -26.727922061358F,   25.440734982460F,
                        -10.571849954929F,   15.953290065267F,  -35.741825477920F,    4.789688774154F,
                         -7.000000000000F,   -3.464101615137F,  -23.995238822098F,   -5.886255830454F,
                          4.544646017019F,   -2.791513911031F,  -20.727922061358F,    2.272077938642F,
                         -3.866896714861F,    4.183818756445F,  -37.248078874273F,   -1.159151854595F,
                        -19.000000000000F,  -14.535898384862F,  -39.677179906405F,  -32.517610835513F,
                         -0.983392686809F,  -48.522509446919F,   -1.272077938642F,  -55.440734982460F,
                         48.938746669791F,  -48.715947146597F,   45.321542597114F,  -28.517201792763F,
                         77.000000000000F,    0.000000000001F,   45.321542597114F,   28.517201792762F,
                         48.938746669790F,   48.715947146598F,   -1.272077938642F,   55.440734982459F,
                         -0.983392686809F,   48.522509446920F,  -39.677179906405F,   32.517610835511F,
                        -19.000000000000F,   14.535898384862F,  -37.248078874273F,    1.159151854595F,
                         -3.866896714861F,   -4.183818756445F,  -20.727922061358F,   -2.272077938642F,
                          4.544646017019F,    2.791513911033F,  -23.995238822098F,    5.886255830453F,
                         -7.000000000000F,    3.464101615138F,  -35.741825477920F,   -4.789688774155F,
                        -10.571849954930F,  -15.953290065266F,  -26.727922061358F,  -25.440734982460F,
                          9.350289401670F,  -29.323642301184F,   -2.704627201468F,  -26.245123854121F,
                         29.000000000000F,  -18.000000000000F,    6.612858422223F,   -8.528205892287F,
                         27.350289401671F,   -1.853272235055F,   -1.272077938642F,   -0.015109140256F,
                         20.605064581311F,   -2.046709934733F,   -0.968495731513F,   -4.527796849537F,
                         29.000000000000F,   -3.464101615137F,   10.778090924309F,    3.431229793237F,
                         35.721560553259F,   15.208486088969F,    4.727922061358F,   27.727922061358F,
                         14.133103285139F,   35.360733292685F,  -27.930593250583F,   33.614177891811F,
                        -19.000000000000F,   21.464101615138F,  -48.994665530095F,    2.255718910893F,
                        -18.983392686809F,  -17.345594910679F,  -26.727922061357F,  -29.984890859745F,
                         17.761832133551F,  -30.715947146597F,   10.548212850708F,  -19.199716169072F,
                         41.000000000000F,    0.000000000001F,   10.548212850707F,   19.199716169071F,
                         17.761832133550F,   30.715947146599F,  -26.727922061358F,   29.984890859743F,
                        -18.983392686810F,   17.345594910680F,  -48.994665530095F,   -2.255718910895F,
                        -19.000000000000F,  -21.464101615138F,  -27.930593250582F,  -33.614177891812F,
                         14.133103285139F,  -35.360733292684F,    4.727922061358F,  -27.727922061358F,
                         35.721560553259F,  -15.208486088967F,   10.778090924309F,   -3.431229793237F,
                         29.000000000000F,    3.464101615139F,   -0.968495731514F,    4.527796849536F,
                         20.605064581310F,    2.046709934734F,   -1.272077938642F,    0.015109140255F,
                         27.350289401670F,    1.853272235056F,    6.612858422223F,    8.528205892285F,
                         29.000000000000F,   18.000000000000F,   -2.704627201467F,   26.245123854119F,
                   };
const float test_goldenFFT[512] = {
                                   118.657159813059F,  159.587672982178F,  136.091729862351F,  191.259313028377F,
                                   163.143272168582F,  239.100627409115F,  211.468721950419F,  322.381869509820F,
                                   325.967773457414F,  516.284939280209F, 1065.348653716358F, 1779.658503054166F,
                                  -290.665206305244F, -645.466128382799F, 1470.825459178264F,  422.213348124071F,
                                  -332.813736712574F,  -75.724361082332F, -239.457914045880F,  133.005517660332F,
                                  -408.978738393038F,  603.928084180674F,  836.882328513853F, -1409.431054041891F,
                                   310.048732894896F, -317.442286039271F,  370.646564079570F,  -45.187959755067F,
                                  1675.626627317106F, 1139.600641458739F, -424.759073289305F, -573.767158765939F,
                                  -169.225977526906F, -328.222993653366F,  -99.174819352075F, -247.833886134337F,
                                   -66.487100022865F, -204.467732576577F,  -47.437851852223F, -176.206038348315F,
                                   -34.855903050976F, -155.875501823927F,  -25.849807207202F, -140.336962942776F,
                                   -19.033800629720F, -127.963361644318F,  -13.661066211723F, -117.812349257004F,
                                    -9.293178326100F, -109.293666025184F,   -5.655367801445F, -102.015448138430F,
                                    -2.566309967539F,  -95.705606787834F,    0.098758025749F,  -90.168361450754F,
                                     2.428689989690F,  -85.258690645950F,    4.488619079628F,  -80.866551782274F,
                                     6.327474460679F,  -76.906728144105F,    7.982793668937F,  -73.312068475966F,
                                     9.483904501451F,  -70.028852220600F,   10.854088653255F,  -67.013531150688F,
                                    12.112089588121F,  -64.230387959556F,   13.273186493986F,  -61.649821102720F,
                                    14.349974134231F,  -59.247066811181F,   15.352939030534F,  -57.001232271138F,
                                    16.290891856835F,  -54.894554161605F,   17.171296535128F,  -52.911822971678F,
                                    18.000523939745F,  -51.039931002868F,   18.784049780080F,  -49.267513840838F,
                                    19.526610604455F,  -47.584663293361F,   20.232328003966F,  -45.982695559545F,
                                    20.904808399993F,  -44.453962505975F,   21.547223891659F,  -42.991696894031F,
                                    22.162378271491F,  -41.589884572951F,   22.752761324010F,  -40.243158258021F,
                                    23.320593792139F,  -38.946708712482F,   23.867864854348F,  -37.696210056657F,
                                    24.396363548938F,  -36.487756616927F,   24.907705274124F,  -35.317809256436F,
                                    25.403354257477F,  -34.183149539155F,   25.884642707287F,  -33.080840398515F,
                                    26.352787217906F,  -32.008192232861F,   26.808902891312F,  -30.962733548430F,
                                    27.254015550709F,  -29.942185428485F,   27.689072353491F,  -28.944439233542F,
                                    28.114951056378F,  -27.967537039294F,   28.532468141770F,  -27.009654401005F,
                                    28.942385979210F,  -26.069085099918F,   29.345419167296F,  -25.144227581679F,
                                    29.742240178265F,  -24.233572841372F,   30.133484408558F,  -23.335693546432F,
                                  1566.519754723181F,  -22.449234218830F,   30.901625569159F,  -21.572902323215F,
                                    31.279646722602F,  -20.705460127081F,   31.654346725656F,  -19.845717218515F,
                                    32.026236062605F,  -18.992523578077F,   32.395810118248F,  -18.144763115380F,
                                    32.763551957385F,  -17.301347589181F,   33.129934960279F,  -16.461210837768F,
                                    33.495425346031F,  -15.623303252464F,   33.860484613506F,  -14.786586431778F,
                                    34.225571927775F,  -13.950027957123F,   34.591146478948F,  -13.112596233385F,
                                    34.957669839685F,  -12.273255338799F,   35.325608347614F,  -11.430959828797F,
                                    35.695435539346F,  -10.584649437636F,   36.067634663742F,   -9.733243619721F,
                                    36.442701303601F,   -8.875635869486F,   36.821146137086F,   -8.010687754515F,
                                    37.203497872950F,   -7.137222590998F,   37.590306397182F,   -6.254018683603F,
                                    37.982146173063F,   -5.359802043075F,   38.379619942028F,   -4.453238484150F,
                                    38.783362779281F,   -3.532924993273F,   39.194046566122F,   -2.597380239784F,
                                    39.612384950604F,   -1.645034085080F,   40.039138879882F,   -0.674215921060F,
                                    40.475122801856F,    0.316858358802F,   40.921211651023F,    1.330100986418F,
                                    41.378348754560F,    2.367568815952F,   41.847554820470F,    3.431482012700F,
                                    42.329938201339F,    4.524245317594F,   42.826706666312F,    5.648472346308F,
                                    43.339180962309F,    6.807013475004F,   43.868810505763F,    8.002987980009F,
                                    44.417191621541F,    9.239821242248F,   44.986088840646F,   10.521288006997F,
                                    45.577459888412F,   11.851562915958F,   46.193485148064F,   13.235279815627F,
                                    46.836602580971F,   14.677601712096F,   47.509549338807F,   16.184303712937F,
                                    48.215411633545F,   17.761871905944F,   48.957684865376F,   19.417621919407F,
                                    49.740346583745F,   21.159841954870F,   50.567945625530F,   22.997966472922F,
                                    51.445711812507F,   24.942788576471F,   52.379692006868F,   27.006721662111F,
                                    53.376920279058F,   29.204124372885F,   54.445632674685F,   31.551707690169F,
                                    55.595540936691F,   34.069049756584F,   56.838185097411F,   36.779253653665F,
                                    58.187392965420F,   39.709797308630F,   59.659886568529F,   42.893645256711F,
                                    61.276093812846F,   46.370722833328F,   63.061251701784F,   50.189900633916F,
                                    65.046931788186F,   54.411711164435F,   67.273190283236F,   59.112138722977F,
                                    69.791664685789F,   64.388020612552F,   72.670144007703F,   70.364934454220F,
                                    75.999505137089F,   77.209043032694F,   79.904586101448F,   85.145471045813F,
                                    84.561887167662F,   94.487929202449F,   90.229708887986F,  105.688703935988F,
                                    97.302321393430F,  119.427830468455F,  106.414063733956F,  136.783507757608F,
                                   198.866153336279F,  234.736200354811F,  289.456105966526F,  385.550373040917F,
                                   610.577700100775F, 2074.162997806164F,  707.893201723219F, 1530.226010333470F,
                                   341.319736033406F,  273.917068338753F,  729.378323861972F, 1639.166839548801F,
                                   443.733953778126F,  373.390984319140F, 2026.428931935998F,  713.883059625263F,
                                   369.280063140044F,  266.940592473239F,  215.006018833095F,  182.479910507325F,
                                   159.725095230399F,  142.697847568390F,  129.371200387592F,  118.601746899004F,
                                   109.688051293772F,  102.172084464663F,   95.740007924989F,   90.168415533719F,
                                    85.293275618467F,   80.991029740319F,   77.166584522589F,   73.745402426087F,
                                    70.668129930877F,   67.886851435141F,   65.362416200946F,   63.062492193867F,
                                    60.960123715275F,   59.032645352411F,   57.260852544233F,   55.628359987361F,
                                    54.121099572005F,   52.726923352284F,   51.435286549611F,   50.236992220692F,
                                    49.123983925605F,   48.089176113399F,   47.126314405437F,   46.229859771012F,
                                    45.394891941196F,   44.617028423473F,   43.892356251949F,   43.217374199465F,
                                    42.588943635022F,   42.004246565746F,   41.460749681693F,   40.956173442192F,
                                    40.488465417598F,   40.055777240507F,   39.656444633209F,   39.288970069510F,
                                    38.952007703280F,   38.644350256973F,   38.364917613357F,   38.112746895150F,
                                  1566.680602437838F,   37.686875400642F,   37.511763197228F,   37.361078123434F,
                                    37.234335608434F,   37.131131705495F,   37.051139864597F,   36.994108351436F,
                                    36.959858273944F,   36.948282186942F,   36.959343254281F,   36.993074956102F,
                                    37.049581336795F,   37.129037797074F,   37.231692441538F,   37.357868001239F,
                                    37.507964359469F,   37.682461718271F,   37.881924453439F,   38.107005717176F,
                                    38.358452860522F,   38.637113762434F,   38.943944169504F,   39.280016170279F,
                                    39.646527951586F,   40.044815012067F,   40.476363041222F,   40.942822711947F,
                                    41.446026682329F,   41.988009160423F,   42.571028456251F,   43.197593031665F,
                                    43.870491665044F,   44.592828479462F,   45.368063746797F,   46.200061585508F,
                                    47.093145928369F,   48.052166464400F,   49.082576677949F,   50.190526646461F,
                                    51.382973956315F,   52.667817007947F,   54.054056182919F,   55.551989943441F,
                                    57.173455080711F,   58.932123240802F,   60.843869854438F,   62.927237151432F,
                                    65.204020760686F,   67.700020564902F,   70.446012679247F,   73.479023324880F,
                                    76.844021296689F,   80.596200852386F,   84.804113384309F,   89.554045555122F,
                                    94.956272346886F,  101.154208171716F,  108.338179360310F,  116.766836557548F,
                                   126.801741022446F,  138.965832151934F,  154.047877099791F,  173.302282024358F,
                                     0.931453182077F,    0.952356626113F,    0.972034569420F,    0.990244631651F,
                                     1.007628128246F,    1.031388228383F,   -1.993914915644F,    0.279542231426F,
                                    -2.917873567625F,    2.634579219632F,    2.166054286186F,   -1.034967966837F,
                                    -0.797180341619F,   -0.121317863940F,    0.597247880684F,   -2.208059627524F,
                                    -2.046831952557F,   -1.951446232083F,   -1.885183425586F,   -1.833779229595F,
                                    -1.790790910432F,   -1.752952655098F,   -1.718457827205F,   -1.686236918918F,
                                    -1.655621721968F,   -1.626176028773F,   -1.597604527895F,   -1.569701064724F,
                                    -1.542317899985F,   -1.515346728478F,   -1.488706564580F,   -1.462335784216F,
                                    -1.436186763121F,   -1.410222182404F,   -1.384412431449F,   -1.358733749134F,
                                    -1.333166871684F,   -1.307696034485F,   -1.282308225227F,   -1.256992618189F,
                                    -1.231740140854F,   -1.206543138420F,   -1.181395111583F,   -1.156290509736F,
                                    -1.131224566519F,   -1.106193168015F,   -1.081192746352F,   -1.056220193222F,
                                    -1.031272789131F,   -1.006348145186F,   -0.981444154906F,   -0.956558954132F,
                                    -0.931690887497F,   -0.906838480251F,   -0.882000414480F,   -0.857175508943F,
                                    -0.832362701912F,   -0.807561036504F,   -0.782769648105F,   -0.757987753548F,
                                    -0.733214641760F,   -0.708449665670F,   -0.683692235177F,   -0.658941811019F,
                                    -0.014329661379F,   -0.609460047426F,   -0.584727838758F,   -0.560000890238F,
                                    -0.535278848590F,   -0.510561387643F,   -0.485848205861F,   -0.461139024157F,
                                    -0.436433583975F,   -0.411731645590F,   -0.387032986619F,   -0.362337400712F,
                                    -0.337644696417F,   -0.312954696191F,   -0.288267235558F,   -0.263582162404F,
                                    -0.238899336394F,   -0.214218628519F,   -0.189539920765F,   -0.164863105901F,
                                    -0.140188087403F,   -0.115514779502F,   -0.090843107383F,   -0.066173007527F,
                                    -0.041504428235F,   -0.016837330329F,    0.007828311917F,    0.032492509612F,
                                     0.057155257793F,    0.081816533626F,    0.106476294229F,    0.131134474017F,
                                     0.155790981491F,    0.180445695359F,    0.205098459853F,    0.229749079058F,
                                     0.254397310056F,    0.279042854598F,    0.303685348979F,    0.328324351677F,
                                     0.352959328218F,    0.377589632564F,    0.402214484124F,    0.426832939228F,
                                     0.451443855555F,    0.476045847506F,    0.500637229910F,    0.525215946542F,
                                     0.549779478745F,    0.574324727770F,    0.598847862077F,    0.623344117532F,
                                     0.647807533629F,    0.672230601947F,    0.696603792909F,    0.720914911853F,
                                     0.745148212946F,    0.769283165414F,    0.793292714858F,    0.817140803700F,
                                     0.840778796501F,    0.864140285504F,    0.887133535806F,    0.909630675443F,
                              };
float32_t test_output[myCFFT0_CFFT_SIZE << 1];
float32_t test_twiddles[myCFFT0_CFFT_SIZE];
float32_t *inPtr = test_input;
float32_t *outPtr = test_output;
float32_t *twiddleFacs = test_twiddles;

uint16_t pass = 0U, fail = 0U;
float tolerance = 3e-2;

void main(void)
{
    //
    // CPU initialization
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    //
    // Variable initialization
    //
    int16_t i;
    float32u_t out, gold, err;
    float *p_temp;

    //
    // Run complex FFT function
    //
    CFFT_f32t(myCFFT0_handle);

    //
    // Verify results
    //
    p_temp      = CFFT_f32_getCurrInputPtr(myCFFT0_handle);
    for(i = 0U; i < (myCFFT0_CFFT_SIZE << 1); i++)
    {
        out.f32  = p_temp[i];
        gold.f32 = test_goldenFFT[i];
        err.f32  = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }
    while(1);
}
